# FrictionFactor Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
MEPSection..::..FrictionFactor Property
MEPSection Class See Also
---
The friction factor of the section.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public double FrictionFactor { get; }
```

Visual Basic
---
```text
Public ReadOnly Property FrictionFactor As Double
	Get
```

Visual C++
---
```text
public:
property double FrictionFactor {
	double get ();
}
```

# Remarks
Friction Factor is a number. The friction factor type is UT_Number.
# See Also
MEPSection Class
Autodesk.Revit.DB.Mechanical Namespace